---
kind: enumMember
id: F:Autodesk.Revit.DB.DirectShapeTypeUserAssignability.Assignable
enum: Autodesk.Revit.DB.DirectShapeTypeUserAssignability
source: html/2d6edb93-3c18-dc5b-e13b-95b135509de4.htm
---
# Autodesk.Revit.DB.DirectShapeTypeUserAssignability.Assignable

The DirectShapeType can be used to replace the type of an existing DirectShape.